Revit 2026 API

# ViewGetCropRegionShapeManagerForReferenceCallout Method

---

Returns an object for managing view crop region shape for reference callout.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ViewCropRegionShapeManager GetCropRegionShapeManagerForReferenceCallout(
	Document doc,
	ElementId callout
)
```
```vb
Public Shared Function GetCropRegionShapeManagerForReferenceCallout (
	doc As Document,
	callout As ElementId
) As ViewCropRegionShapeManager
```
```cpp
public:
static ViewCropRegionShapeManager^ GetCropRegionShapeManagerForReferenceCallout(
	Document^ doc,
	ElementId^ callout
)
```
```fsharp
static member GetCropRegionShapeManagerForReferenceCallout :
        doc : Document *
        callout : ElementId -> ViewCropRegionShapeManager
```

#### Parameters

doc Document
     Document to which the callout belongs.
callout ElementId
     Element id of reference callout.

#### Return Value

ViewCropRegionShapeManager The crop region shape manager.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Reference callout is a view-specific element referencing another view. It can have its own crop region shape which doesn't affect the referenced view.

#### Reference

View Class

Autodesk.Revit.DB Namespace